ofcases/plate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

functions
{
    // minMax
    // {
    //     type          fieldMinMax;
    //     libs          (fieldFunctionObjects);
    //     writeControl  timeStep;
    //     fields        (U);
    // }
    // #includeFunc fieldMinMax(fields=(U));

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        patches         (fixedWall);
        writeControl    writeTime;
    }
    // #includeFunc yPlus;

    // #includeFunc "writeCellCentres"
    // #includeFunc "wallShearStress"
}


// ************************************************************************* //
